In [5]:
import pandas as pd 
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt 

%matplotlib inline

In [10]:
# pip install kaggle

In [1]:
import kaggle 
!kaggle datasets download rizwanbakht/employeedepartment -f Empl-Depart.csv

Dataset URL: https://www.kaggle.com/datasets/rizwanbakht/employeedepartment
License(s): unknown
Downloading Empl-Depart.csv to c:\Users\wanji\Desktop\Data Project\Data-Project

  0%|          | 0.00/4.17k [00:00<?, ?B/s]
100%|██████████| 4.17k/4.17k [00:00<00:00, 2.12MB/s]

In [3]:
# Extract data from the file 
# zip_ref = zipfile.ZipFile('Empl-Depatrt.csv')
# zip_ref.extractall()
# zip_ref.close()

In [8]:
# Read the dataset
employee_data = pd.read_csv('Empl-Depart.csv')
employee_data.head()

,First Name,Last Name,Email,Phone Number,Hire Date,Job,Salary,Commission Percent,Manager,Department
0,Steven,King,SKING,515.123.4567,10/10/2009,President,"24,000",NaN,NaN,ACCOUNTING
1,Neena,Kochhar,NKOCHHAR,515.123.4568,1/15/2012,Administration Vice President,"17,000",NaN,Steven,RESEARCH
2,Lex,De Haan,LDEHAAN,515.123.4569,5/9/2015,Administration Vice President,"17,000",NaN,Steven,SALES
3,Alexander,Hunold,AHUNOLD,590.423.4567,4/28/2012,Programmer,"9,000",NaN,Lex,SALES
4,Bruce,Ernst,BERNST,590.423.4568,9/13/2013,Programmer,"6,000",NaN,Alexander,SALES

In [9]:
employee_data.columns

Index(['First Name', 'Last Name', 'Email', 'Phone Number', 'Hire Date', 'Job ',
       'Salary', 'Commission Percent', 'Manager', 'Department'],
      dtype='object')

In [10]:
employee_data.columns = employee_data.columns.str.lower()

In [12]:
employee_data.head()

,first name,last name,email,phone number,hire date,job,salary,commission percent,manager,department
0,Steven,King,SKING,515.123.4567,10/10/2009,President,"24,000",NaN,NaN,ACCOUNTING
1,Neena,Kochhar,NKOCHHAR,515.123.4568,1/15/2012,Administration Vice President,"17,000",NaN,Steven,RESEARCH
2,Lex,De Haan,LDEHAAN,515.123.4569,5/9/2015,Administration Vice President,"17,000",NaN,Steven,SALES
3,Alexander,Hunold,AHUNOLD,590.423.4567,4/28/2012,Programmer,"9,000",NaN,Lex,SALES
4,Bruce,Ernst,BERNST,590.423.4568,9/13/2013,Programmer,"6,000",NaN,Alexander,SALES

In [14]:
# Convert columns with spaces to underscore : We use 'str.replace'
employee_data.columns = employee_data.columns.str.replace(' ', '_')
employee_data.head()

,first_name,last_name,email,phone_number,hire_date,job_,salary,commission_percent,manager,department
0,Steven,King,SKING,515.123.4567,10/10/2009,President,"24,000",NaN,NaN,ACCOUNTING
1,Neena,Kochhar,NKOCHHAR,515.123.4568,1/15/2012,Administration Vice President,"17,000",NaN,Steven,RESEARCH
2,Lex,De Haan,LDEHAAN,515.123.4569,5/9/2015,Administration Vice President,"17,000",NaN,Steven,SALES
3,Alexander,Hunold,AHUNOLD,590.423.4567,4/28/2012,Programmer,"9,000",NaN,Lex,SALES
4,Bruce,Ernst,BERNST,590.423.4568,9/13/2013,Programmer,"6,000",NaN,Alexander,SALES

In [16]:
# Convert the order date to datettim
# employee_data['hire_date'] = pd.to_datetime(employee_data['hire_date'],format="%Y-%m-%d")

In [17]:
# Load the data to the sql server 
import sqlalchemy as sal

# Define your PostgreSQL details
username = 'postgres'
password = 'Edna90!'
hostname = 'localhost'
port = '5432'

# Create the SQLAlchemy engine without specifying the database
engine = sal.create_engine(f'postgresql+psycopg2://{username}:{password}@{hostname}:{port}/postgres')

In [25]:
# Write the data to the SQL server
employee_data.to_sql('employee_table', con=engine, if_exists='append', index=False)

50